app/Models/AyudaModel.php

    public function SelectAyudaTaller($idTaller)
    {
        $builder = $this->db->table('ayuda A');
        $builder->select("A.descripcionProblema AS 'problema', A.descripcionAutomovil AS 'descripcionAutomovil', A.latitud AS 'latitudCliente', A.longitud AS 'longitudCliente', CONCAT(CL.nombres, ' ', CL.primerApellido, ' ',CL.segundoApellido) AS 'nombreCliente',T.latitud AS 'latitudTaller', T.longitud AS 'longitudTaller', A.idAyuda AS 'idAyuda', A.estado AS 'estado', CL.celular AS 'celular'");
        $builder->join("cliente CL","CL.idCliente = A.idCliente", "inner");
        $builder->join("taller T", "T.idTaller = A.idTaller", "inner");
        $builder->where('A.idTaller',$idTaller);
        $builder->where('A.estado > 0');
        $query = $builder->get();
---
SELECT A.descripcionProblema AS 'problema', A.descripcionAutomovil AS 'descripcionAutomovil', A.latitud AS 'latitudCliente', A.longitud AS 'longitudCliente', CONCAT(CL.nombres, ' ', `CL`.`primerApellido`, ' ', CL.segundoApellido) AS 'nombreCliente', T.latitud AS 'latitudTaller', T.longitud AS 'longitudTaller', A.idAyuda AS 'idAyuda', A.estado AS 'estado', CL.celular AS 'celular'
FROM `ayuda` `A`
INNER JOIN `cliente` `CL` ON `CL`.`idCliente` = `A`.`idCliente`
INNER JOIN `taller` `T` ON `T`.`idTaller` = `A`.`idTaller`
WHERE `A`.`idTaller` = '5'
AND `A`.`estado` >0