app/Models/CalificarModel.php

SELECT `calificacion`
FROM `calificacion`
WHERE `idTaller` = '4'
AND `idCliente` = '11'
---
    public function CalificacionExist($idTaller, $idCliente)
    {
        $builder = $this->db->table('calificacion');
        $builder->select("calificacion");
        $builder->where("idTaller", $idTaller);
        $builder->where("idCliente", $idCliente);
        $query = $builder->get();

INSERT INTO `calificacion` (`idTaller`, `idCliente`, `calificacion`) VALUES ('4', '11', '5')
---
    public function InsertCalificacion($idTaller, $idCliente, $calificacion)
    {
        $builder = $this->db->table('calificacion');
        $data = [
            'idTaller' => $idTaller,
            'idCliente' => $idCliente,
            'calificacion' => $calificacion
        ];
        $query = $builder->insert($data);