app/Models/CitaModel.php

SELECT C.descripcion AS 'descripcionProblema', C.fechaCita AS 'fechaCita', C.estado AS 'estado', S.descripcion AS 'servicio', CONCAT(CL.nombres, ' ', `CL`.`primerApellido`, ' ', CL.segundoApellido) AS 'cliente', C.idCita AS 'idCita', C.idCliente AS 'idCliente'
FROM `cita` `C`
INNER JOIN `servicio` `S` ON `S`.`idServicio` = `C`.`idServicio`
INNER JOIN `cliente` `CL` ON `CL`.`idCliente` = `C`.`idCliente`
WHERE `C`.`idTaller` = '5'
AND `C`.`estado` = '0'
---
    public function SelectCitasTallerPendiente($idTaller)
    {
        $builder = $this->db->table('cita C');
        $builder->select("C.descripcion AS 'descripcionProblema', C.fechaCita AS 'fechaCita', C.estado AS 'estado', S.descripcion AS 'servicio', CONCAT(CL.nombres,' ', CL.primerApellido, ' ', CL.segundoApellido) AS 'cliente', C.idCita AS 'idCita', C.idCliente AS 'idCliente'");
        $builder->join("servicio S","S.idServicio = C.idServicio", "inner");
        $builder->join("cliente CL", "CL.idCliente = C.idCliente", "inner");
        $builder->where('C.idTaller',$idTaller);
        $builder->where('C.estado', '0');
        $query = $builder->get();