app/Models/ClienteModel.php

INSERT INTO `cliente` (`idCliente`, `nombres`, `primerApellido`, `segundoApellido`, `celular`) VALUES ('5', 'Juan ', 'Asd', 'Asd', '65478945')
---
    public function InsertCliente($idUsuario, $nombres,$primerApellido, $segundoApellido,$celular,$foto)
    {
        $builder = $this->db->table('cliente');
        $data = [
            'idCliente' => $idUsuario,
            'nombres' => $nombres,
            'primerApellido' => $primerApellido,
            'segundoApellido' => $segundoApellido,
            'celular' => $celular,
            'foto' => $foto
        ];
        $query = $builder->insert($data);