app/Models/CotizacionModel.php

SELECT C.descripcionProblema AS 'descripcionProblema', C.estado AS 'estado', S.descripcion AS 'servicio', CONCAT(CL.nombres, ' ', `CL`.`primerApellido`, ' ', CL.segundoApellido) AS 'cliente', C.idCotizacion AS 'idCotizacion', C.idCliente AS 'idCliente'
FROM `cotizacion` `C`
INNER JOIN `servicio` `S` ON `S`.`idServicio` = `C`.`idServicio`
INNER JOIN `cliente` `CL` ON `CL`.`idCliente` = `C`.`idCliente`
WHERE `C`.`idTaller` = '5'
AND `C`.`estado` = '0'
---
    public function SelectCotizacionTallerPendiente($idTaller)
    {
        $builder = $this->db->table('cotizacion C');
        $builder->select("C.descripcionProblema AS 'descripcionProblema', C.estado AS 'estado', S.descripcion AS 'servicio', CONCAT(CL.nombres,' ', CL.primerApellido, ' ', CL.segundoApellido) AS 'cliente', C.idCotizacion AS 'idCotizacion', C.idCliente AS 'idCliente'");
        $builder->join("servicio S","S.idServicio = C.idServicio", "inner");
        $builder->join("cliente CL", "CL.idCliente = C.idCliente", "inner");
        $builder->where('C.idTaller',$idTaller);
        $builder->where('C.estado', '0');
        $query = $builder->get();

SELECT C.fechaCreacion AS 'fecha', C.descripcionSolucion AS 'solucion', C.tiempoAprox AS 'tiempo', C.costo AS 'costo', S.descripcion AS 'servicio', C.idTaller AS 'idTaller', C.idCliente AS 'idCliente'
FROM `cotizacion` `C`
INNER JOIN `servicio` `S` ON `S`.`idServicio` = `C`.`idServicio`
WHERE `C`.`idCotizacion` = '1'
---
    public function SelectCotizacionPDF($idCotizacion)
    {
        $builder = $this->db->table('cotizacion C');
        $builder->select("C.fechaCreacion AS 'fecha', C.descripcionSolucion AS 'solucion', C.tiempoAprox AS 'tiempo', C.costo AS 'costo', S.descripcion AS 'servicio', C.idTaller AS 'idTaller', C.idCliente AS 'idCliente'");
        $builder->join("servicio S", "S.idServicio = C.idServicio", "inner");
        $builder->where("C.idCotizacion", $idCotizacion);
        $query = $builder->get();