app/Models/ForoModel.php

SELECT F.pregunta AS 'pregunta', CONCAT(C.nombres, ' ', `C`.`primerApellido`, ' ', C.segundoApellido) AS 'nombre', C.foto AS 'foto', U.idUsuario AS 'idUsuario'
FROM `foro` `F`
INNER JOIN `usuario` `U` ON `U`.`idUsuario` = `F`.`idUsuario`
INNER JOIN `cliente` `C` ON `C`.`idCliente` = `U`.`idUsuario`
WHERE `F`.`idForo` = '1'
---
    public function SelectPreguntasForoMain()
    {
        $builder = $this->db->table('foro F');
        $builder->select("F.idForo AS 'idForo', F.pregunta AS 'pregunta', F.idForo AS 'idForo',C.foto AS 'foto',CONCAT(C.nombres,' ',C.primerApellido, ' ',C.segundoApellido) AS 'cliente', F.idUsuario AS 'idUsuario', (SELECT COUNT(CM.idForo) FROM comentario CM WHERE CM.idForo = F.idForo) AS 'respuestas', T.nombre AS 'taller', U.rol AS 'rol', T.fotoPerfil AS 'fotoTaller'");
        $builder->join("usuario U", "U.idUsuario = F.idUsuario", "inner");
        $builder->join("cliente C", "C.idCliente = U.idUsuario", "left");
        $builder->join("taller T", "T.idTaller = U.idUsuario", "left");
        $builder->orderBy('F.fechaCreacion', 'desc');
        $builder->limit('3');
        $query = $builder->get();

SELECT F.pregunta AS 'pregunta', CONCAT(C.nombres, ' ', `C`.`primerApellido`, ' ', C.segundoApellido) AS 'nombre', C.foto AS 'foto', U.idUsuario AS 'idUsuario'
FROM `foro` `F`
INNER JOIN `usuario` `U` ON `U`.`idUsuario` = `F`.`idUsuario`
INNER JOIN `cliente` `C` ON `C`.`idCliente` = `U`.`idUsuario`
WHERE `F`.`idForo` = '4'
---
    public function SelectPreguntaForo($idForo)
    {
        $builder = $this->db->table('foro F');
        $builder->select("F.pregunta AS 'pregunta', CONCAT(C.nombres,' ',C.primerApellido, ' ',C.segundoApellido) AS 'cliente', C.foto AS 'foto', U.idUsuario AS 'idUsuario', U.rol AS 'rol', T.nombre AS 'taller', T.fotoPerfil AS 'fotoTaller'");
        $builder->join("usuario U", "U.idUsuario = F.idUsuario", "inner");
        $builder->join("cliente C", "C.idCliente = U.idUsuario", "left");
        $builder->join("taller T", "T.idTaller = U.idUsuario", "left");
        $builder->where("F.idForo", $idForo);
        $query = $builder->get();

SELECT C.descripcion AS 'comentario', CONCAT(CL.nombres, ' ', `CL`.`primerApellido`, ' ', CL.segundoApellido) AS 'nombre', C.fechaCreacion AS 'fechaRegistro', CL.foto AS 'foto', U.idUsuario AS 'idUsuario'
FROM `comentario` `C`
INNER JOIN `usuario` `U` ON `U`.`idUsuario` = `C`.`idUsuario`
INNER JOIN `cliente` `CL` ON `CL`.`idCliente` = `U`.`idUsuario`
WHERE `C`.`idForo` = '4'
---
    public function SelectRespuestas($idForo)
    {
        $builder = $this->db->table('comentario C');
        $builder->select("C.descripcion AS 'comentario', CONCAT(CL.nombres,' ',CL.primerApellido, ' ',CL.segundoApellido) AS 'cliente', C.fechaCreacion AS 'fechaRegistro', CL.foto AS 'foto', U.idUsuario AS 'idUsuario', T.nombre AS 'taller', T.fotoPerfil AS 'fotoTaller', U.rol AS 'rol'");
        $builder->join("usuario U", "U.idUsuario = C.idUsuario", "inner");
        $builder->join("cliente CL", "CL.idCliente = U.idUsuario", "left");
        $builder->join("taller T", "T.idTaller = U.idUsuario", "left");
        $builder->where("C.idForo", $idForo);
        $query = $builder->get();