app/Models/ForoModel.php

SELECT C.descripcion AS 'comentario', CONCAT(CL.nombres, ' ', `CL`.`primerApellido`, ' ', CL.segundoApellido) AS 'nombre', C.fechaCreacion AS 'fechaRegistro', CL.foto AS 'foto', `U`.`idUsuario` AS `idUsuario`
FROM `comentario` `C`
INNER JOIN `usuario` `U` ON `U`.`idUsuario` = `C`.`idUsuario`
INNER JOIN `cliente` `CL` ON `CL`.`idCliente` = `U`.`idUsuario`
WHERE `C`.`idForo` = '1'
---
    public function SelectRespuestas($idForo)
    {
        $builder = $this->db->table('comentario C');
        $builder->select("C.descripcion AS 'comentario', CONCAT(CL.nombres,' ',CL.primerApellido, ' ',CL.segundoApellido) AS 'nombre', C.fechaCreacion AS 'fechaRegistro', CL.foto AS 'foto', U.idUsuario AS idUsuario");
        $builder->join("usuario U", "U.idUsuario = C.idUsuario", "inner");
        $builder->join("cliente CL", "CL.idCliente = U.idUsuario", "inner");
        $builder->where("C.idForo", $idForo);
        $query = $builder->get();