app/Models/ServicioTallerModel.php

SELECT S.descripcion AS 'descripcion', ST.estado AS 'estado', ST.idServicio AS 'idServicio'
FROM `serviciotaller` `ST`
INNER JOIN `servicio` `S` ON `S`.`idServicio` = `ST`.`idServicio`
WHERE `ST`.`idTaller` = '5'
ORDER BY `ST`.`estado` DESC
---
    public function SelectServiciosTaller($idTaller)
    {
        $builder = $this->db->table('serviciotaller ST');
        $builder->select("S.descripcion AS 'descripcion', ST.estado AS 'estado', ST.idServicio AS 'idServicio'");
        $builder->join("servicio S", "S.idServicio = ST.idServicio", "inner");
        $builder->where('ST.idTaller',$idTaller);
        $builder->orderBy("ST.estado", "desc");
        $query = $builder->get();