app/Models/ServicioModel.php

    public function SelectServicio()
    {
        $builder = $this->db->table('servicio');
        $builder->select("descripcion");
        $query = $builder->get();
---
SELECT `descripcion`
FROM `servicio`

    public function SelecIdServicio($descripcion)
    {
        $builder = $this->db->table('servicio');
        $builder->select("*");
        $builder->where('descripcion',$descripcion);
        $query = $builder->get();
---
SELECT *
FROM `servicio`
WHERE `descripcion` = 'Cambio de aceite\r'