app/Models/TallerModel.php

    public function SelecHorarioTaller($id)
    {
        $builder = $this->db->table('horario H');
        $builder->select("D.nombreDia AS 'dia', H.horaInicio AS 'HoraInicio', H.horaFin AS 'HoraFin'");
        $builder->join("dia D", "H.idDia = D.idDia", "inner");
        $builder->where('idTaller', $id);
        $builder->where('estado', 1);
        $query = $builder->get();
---
SELECT D.nombreDia AS 'dia', H.horaInicio AS 'HoraInicio', H.horaFin AS 'HoraFin'
FROM `horario` `H`
INNER JOIN `dia` `D` ON `H`.`idDia` = `D`.`idDia`
WHERE `idTaller` = '5'
AND `estado` = 1

    public function SelectTalleres()
    {
        $builder = $this->db->table('Taller T');
        $builder->select("T.nombre AS 'nombre', T.fotoPerfil AS 'fotoPerfil', T.idTaller AS 'idTaller', AVG(C.calificacion) AS 'calificacion'");
        $builder->join("calificacion C", "C.idTaller = T.idTaller", "left");
        $builder->groupBy("T.idTaller");
        $query = $builder->get();
---
SELECT T.nombre AS 'nombre', T.fotoPerfil AS 'fotoPerfil', T.idTaller AS 'idTaller', AVG(C.calificacion) AS 'calificacion'
FROM `Taller` `T`
LEFT JOIN `calificacion` `C` ON `C`.`idTaller` = `T`.`idTaller`
GROUP BY `T`.`idTaller`