app/Models/TallerModel.php

SELECT D.nombreDia AS 'dia', H.horaInicio AS 'HoraInicio', H.horaFin AS 'HoraFin'
FROM `horario` `H`
INNER JOIN `dia` `D` ON `H`.`idDia` = `D`.`idDia`
WHERE `idTaller` = '5'
AND `estado` = 1
---
    public function SelecHorarioTaller($id)
    {
        $builder = $this->db->table('horario H');
        $builder->select("D.nombreDia AS 'dia', H.horaInicio AS 'HoraInicio', H.horaFin AS 'HoraFin'");
        $builder->join("dia D", "H.idDia = D.idDia", "inner");
        $builder->where('idTaller', $id);
        $builder->where('estado', 1);
        $query = $builder->get();