app/Models/TallerModel.php

    public function SelectDia()
    {
        $builder = $this->db->table('dia');
        $builder->select("nombreDia");
        $query = $builder->get();
---
SELECT `nombreDia`
FROM `dia`

    public function SelectById($id)
    {
        $builder = $this->db->table('taller');
        $builder->select("*");
        $builder->where('idTaller', $id);
        $query = $builder->get();
---
SELECT *
FROM `taller`
WHERE `idTaller` = '5'

    public function SelectByIdPDF($idTaller)
    {
        $builder = $this->db->table('taller T');
        $builder->select("T.nombre AS 'nombreTaller', T.direccion AS 'direccion', T.telefono AS 'telefono', U.email AS 'email'");
        $builder->join("usuario U", "U.idUsuario = T.idTaller", "inner");
        $builder->where('idTaller', $idTaller);
        $query = $builder->get();
---
SELECT T.nombre AS 'nombreTaller', T.direccion AS 'direccion', T.telefono AS 'telefono', U.email AS 'email'
FROM `taller` `T`
INNER JOIN `usuario` `U` ON `U`.`idUsuario` = `T`.`idTaller`
WHERE `idTaller` = '5'

    public function SelectTalleres()
    {
        $builder = $this->db->table('Taller T');
        $builder->select("T.nombre AS 'nombre', T.fotoPerfil AS 'fotoPerfil', T.idTaller AS 'idTaller', AVG(C.calificacion) AS 'calificacion'");
        $builder->join("calificacion C", "C.idTaller = T.idTaller", "left");
        $builder->groupBy("T.idTaller");
        $query = $builder->get();
---
SELECT T.nombre AS 'nombre', T.fotoPerfil AS 'fotoPerfil', T.idTaller AS 'idTaller', AVG(C.calificacion) AS 'calificacion'
FROM `Taller` `T`
LEFT JOIN `calificacion` `C` ON `C`.`idTaller` = `T`.`idTaller`
GROUP BY `T`.`idTaller`

    public function SelectTalleresAyuda()
    {
        $builder = $this->db->table('taller');
        $builder->select("nombre, idTaller, latitud, longitud");
        $query = $builder->get();
---
SELECT `nombre`, `idTaller`, `latitud`, `longitud`
FROM `taller`