app/Models/UsuarioModel.php

    public function EmailExists($email)
    {
        $builder = $this->db->table('usuario');
        $builder->select("email");
        $builder->where("email", $email);
        $query = $builder->get();
---
SELECT `email`
FROM `usuario`
WHERE `email` = 'ejemplo@gmail.comsaasd'

    public function SelectNext()
    {
        $builder = $this->db->table('usuario');
        $builder->select("IFNULL(MAX(idUsuario) + 1, 1) AS next");
        $query = $builder->get();
---
SELECT IFNULL(MAX(idUsuario) + 1, 1) AS next
FROM `usuario`

    public function InsertUsuario($idUsuario,$password, $email, $key, $rol)
    {

        $builder = $this->db->table('usuario');
        $data = [
            'idUsuario' => $idUsuario,
            'password' => md5($password),
            'email' => $email,
            'key' => $key,
            'rol' => $rol,
        ];
        $query = $builder->insert($data);
---
INSERT INTO `usuario` (`idUsuario`, `nombreUsuario`, `password`, `email`, `key`, `rol`) VALUES ('5', 'asd', 'defac44447b57f152d14f30cea7a73cb', 'ejemplo@gmail.comsaasd', 'ejemplo@gmail.comsaasd', '2a750436e1368775c28944820d08a8dd')